# 30 Data with Rows and Columns

In [19]:
import pandas as pd
import numpy as np

In [20]:
pd.DataFrame({'id': np.arange(1,11,1), 'grades':np.random.randint(0,101,10)}, columns=['id', 'grades'])

   id  grades
0   1      37
1   2      17
2   3      42
3   4      15
4   5      15
5   6       1
6   7      62
7   8      66
8   9      98
9  10      32

In [21]:
data =  pd.DataFrame({'id':[1,2,3], 'country':['India', 'US', 'Germany']}, index=['x', 'y', 'z'], columns=['id', 'country'])

In [22]:
data

   id  country
x   1    India
y   2       US
z   3  Germany

In [23]:
capitals = pd.Series(['Washington', 'Berlin'], index=['y', 'z'], name='capital')

In [24]:
capitals

y    Washington
z        Berlin
Name: capital, dtype: object

In [25]:
pd.concat([data, capitals], axis=1)

   id  country     capital
x   1    India         NaN
y   2       US  Washington
z   3  Germany      Berlin